## Pandas - Rename the column of dataframe

Dalam tutorial ini kita akan mempelajari bagaimana memberikan nama kolom dari suatu dataFrame menggunakan pandas. 

Kita akan mempelajari:

1. Cara mengganti nama semua kolom dataframe sekaligus
2. Cara mengganti nama kolom spesifik pilihan kita dengan nama kolomnya.
3. Cara mengganti nama kolom spesifik pilihan kita dengan indeks kolom.

In [1]:
#masukan modul yang digunakan
import pandas as pd
import numpy as np

In [2]:
#membuat dataFrame
df = {'Customer_id' : pd.Series([1,2,3,4,5,6]),
      'Product' : pd.Series(['Oven','Oven','Oven','Television','Television','Television']),
      'State' : pd.Series(['California','Texas','Georgia','Florida','Albama','virginia'])}

data = pd.DataFrame(df)
data

   Customer_id     Product       State
0            1        Oven  California
1            2        Oven       Texas
2            3        Oven     Georgia
3            4  Television     Florida
4            5  Television      Albama
5            6  Television    virginia

#### 1. Mengganti nama semua kolom dataframe sekaligus

In [3]:
#mengganti semua nama kolom dengan 'Customer_unique_id', 'Product_type', 'Province'
data.columns = ['Customer_unique_id', 'Product_type', 'Province']

In [4]:
#melihat hasilnya
data

   Customer_unique_id Product_type    Province
0                   1         Oven  California
1                   2         Oven       Texas
2                   3         Oven     Georgia
3                   4   Television     Florida
4                   5   Television      Albama
5                   6   Television    virginia

#### 2. Mengganti nama kolom spesifik pilihan kita dengan nama kolomnya.

In [5]:
#mengganti nama kolom province menjadi state
data.rename(columns = {'Province' : 'State'}, inplace = True)

In [6]:
#menampilkan hasilnya
data

   Customer_unique_id Product_type       State
0                   1         Oven  California
1                   2         Oven       Texas
2                   3         Oven     Georgia
3                   4   Television     Florida
4                   5   Television      Albama
5                   6   Television    virginia

#### 3. Mengganti nama kolom spesifik pilihan kita dengan indeks kolom.

In [7]:
#mengganti nama kolom Customer_unique_id menjadi "customer_id"
data.columns.values[0] = "customer_id"

In [8]:
#menampilkan hasilnya
data

   customer_id Product_type       State
0            1         Oven  California
1            2         Oven       Texas
2            3         Oven     Georgia
3            4   Television     Florida
4            5   Television      Albama
5            6   Television    virginia

                    ##Semoga Bermanfaat
                    ##@Raspiani_